In [1]:
# Import the scrape_price_history function from the price_history_scraper module
from price_history_scraper import scrape_price_history
import pandas as pd

## 1. Chhimek Laghubitta Bittiya Sanstha Limited ( CBBL )

In [2]:
# Define the url to scrape price history data from
url = "https://www.sharesansar.com/company/cbbl"

# Call the scrape_price_history function to fetch the data
cbbl_price_history = scrape_price_history(url)

In [3]:
# Create a DataFrame to store the scraped price history data
cbbl_df = pd.DataFrame({
    "Date" : cbbl_price_history[0],
    "Open" : cbbl_price_history[1],
    "High" : cbbl_price_history[2],
    "Low" : cbbl_price_history[3],
    "Ltp" : cbbl_price_history[4],
    "% Change" : cbbl_price_history[5],
    "Qty" : cbbl_price_history[6],
    "Turnover" : cbbl_price_history[7]
})

In [12]:
# Check the shape of the dataframe
cbbl_df.shape

(2557, 8)

In [13]:
# Show the first five rows of dataframe
cbbl_df.head()

         Date    Open    High     Low     Ltp % Change       Qty      Turnover
0  2023-09-07  958.00  958.00  944.00  945.00    -0.63  8,180.00  7,742,683.60
1  2023-09-05  958.00  959.90  950.00  951.00    -0.73  5,837.00  5,561,731.30
2  2023-09-04  959.00  965.00  942.00  958.00     0.95  6,912.00  6,568,353.20
3  2023-09-03  953.00  959.00  947.00  949.00    -0.42  9,829.00  9,354,692.90
4  2023-08-30  950.00  959.00  949.00  953.00     0.00  7,704.00  7,338,383.20

In [14]:
# Show the information about DataFrame
cbbl_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2557 entries, 0 to 2556
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      2557 non-null   object
 1   Open      2557 non-null   object
 2   High      2557 non-null   object
 3   Low       2557 non-null   object
 4   Ltp       2557 non-null   object
 5   % Change  2557 non-null   object
 6   Qty       2557 non-null   object
 7   Turnover  2557 non-null   object
dtypes: object(8)
memory usage: 159.9+ KB

### <br/> It seems that all the columns have string data type. So, it is necessary to preprocess these <br/> <br/> columns to suitable data types. <br/>

In [15]:
# Check null values in DataFrame
cbbl_df.isnull().sum()

Date        0
Open        0
High        0
Low         0
Ltp         0
% Change    0
Qty         0
Turnover    0
dtype: int64

In [16]:
# Convert the 'Date' column to datetime objects
cbbl_df['Date'] = pd.to_datetime(cbbl_df['Date'])

In [17]:
cbbl_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2557 entries, 0 to 2556
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      2557 non-null   datetime64[ns]
 1   Open      2557 non-null   object
 2   High      2557 non-null   object
 3   Low       2557 non-null   object
 4   Ltp       2557 non-null   object
 5   % Change  2557 non-null   object
 6   Qty       2557 non-null   object
 7   Turnover  2557 non-null   object
dtypes: datetime64[ns](1), object(7)
memory usage: 159.9+ KB

In [18]:
# Count the frequency of unique values in the 'Open' column
cbbl_df['Open'].value_counts()

Open
900.00      24
1,000.00    23
980.00      20
1,600.00    18
870.00      18
            ..
217.00       1
207.00       1
843.00       1
811.00       1
787.00       1
Name: count, Length: 1082, dtype: int64

In [19]:
cbbl_df['High'].value_counts()

High
970.00      22
900.00      19
1,000.00    17
1,600.00    16
1,100.00    16
            ..
481.00       1
509.00       1
519.00       1
529.00       1
530.00       1
Name: count, Length: 1076, dtype: int64

In [20]:
cbbl_df['Low'].value_counts()

Low
1,000.00    24
890.00      20
990.00      17
1,600.00    17
970.00      17
            ..
908.00       1
937.00       1
921.00       1
1,636.00     1
1,003.00     1
Name: count, Length: 1077, dtype: int64

In [21]:
cbbl_df['Ltp'].value_counts()

Ltp
900.00      18
980.00      16
1,000.00    16
1,600.00    15
970.00      14
            ..
1,566.00     1
1,556.00     1
1,604.00     1
1,521.00     1
1,232.00     1
Name: count, Length: 1148, dtype: int64

In [22]:
cbbl_df['Qty'].value_counts()

Qty
100.00       20
10.00        18
200.00       12
20.00        11
50.00         9
             ..
31,908.00     1
30,455.00     1
4,586.00      1
8,715.00      1
15,269.00     1
Name: count, Length: 2142, dtype: int64

In [23]:
cbbl_df['Turnover'].value_counts()

Turnover
0.00             98
19,125.00         2
29,046.00         2
1,309,600.00      2
74,500.00         2
                 ..
17,184,112.00     1
8,272,075.00      1
12,131,078.00     1
15,088,951.00     1
13,078,832.00     1
Name: count, Length: 2454, dtype: int64

### <br/> It can be observed that the columns have comma in the numerical values. These commas should <br/> <br/> be removed before converting these columns to numerical data types. <br/>

In [24]:
cbbl_df.columns

Index(['Date', 'Open', 'High', 'Low', 'Ltp', '% Change', 'Qty', 'Turnover'], dtype='object')

In [25]:
# columns with comma in numerical values
cols_comma_values = ['Open', 'High', 'Low', 'Ltp', 'Qty', 'Turnover']

for col in cols_comma_values:
    # Remove commas and convert the column to float data type
    cbbl_df[col] = cbbl_df[col].apply(lambda x: x.replace(",", ""))
    cbbl_df[col] = cbbl_df[col].astype('float64')

In [26]:
cbbl_df['% Change'] = cbbl_df['% Change'].astype('float64')

In [27]:
cbbl_df.head()

        Date   Open   High    Low    Ltp  % Change     Qty   Turnover
0 2023-09-07  958.0  958.0  944.0  945.0     -0.63  8180.0  7742683.6
1 2023-09-05  958.0  959.9  950.0  951.0     -0.73  5837.0  5561731.3
2 2023-09-04  959.0  965.0  942.0  958.0      0.95  6912.0  6568353.2
3 2023-09-03  953.0  959.0  947.0  949.0     -0.42  9829.0  9354692.9
4 2023-08-30  950.0  959.0  949.0  953.0      0.00  7704.0  7338383.2

In [28]:
cbbl_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2557 entries, 0 to 2556
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      2557 non-null   datetime64[ns]
 1   Open      2557 non-null   float64
 2   High      2557 non-null   float64
 3   Low       2557 non-null   float64
 4   Ltp       2557 non-null   float64
 5   % Change  2557 non-null   float64
 6   Qty       2557 non-null   float64
 7   Turnover  2557 non-null   float64
dtypes: datetime64[ns](1), float64(7)
memory usage: 159.9 KB

In [63]:
# Export DataFrame to csv file
cbbl_df.to_csv("Stock Price History/CBBL Stock Price History.csv", index = False)

## 2. Nabil Bank Limited ( NABIL )

In [4]:
# Define the url to scrape price history data from
url = "https://www.sharesansar.com/company/nabil"

# Call the scrape_price_history function to fetch the data
nabil_price_history = scrape_price_history(url)

In [5]:
# Create a DataFrame to store the scraped price history data
nabil_df = pd.DataFrame({
    "Date" : nabil_price_history[0],
    "Open" : nabil_price_history[1],
    "High" : nabil_price_history[2],
    "Low" : nabil_price_history[3],
    "Ltp" : nabil_price_history[4],
    "% Change" : nabil_price_history[5],
    "Qty" : nabil_price_history[6],
    "Turnover" : nabil_price_history[7]
})

In [29]:
nabil_df.shape

(2845, 8)

In [30]:
nabil_df.head()

,Date,Open,High,Low,Ltp,% Change,Qty,Turnover
0,2023-09-07,585.00,585.00,576.50,577.20,-0.79,"51,168.00","29,566,230.50"
1,2023-09-05,586.00,589.90,580.60,581.80,-0.38,"27,803.00","16,202,031.40"
2,2023-09-04,584.00,587.00,575.30,584.00,0.00,"66,419.00","38,500,932.10"
3,2023-09-03,587.30,590.00,583.00,584.00,-0.56,"46,707.00","27,297,567.60"
4,2023-08-30,596.00,596.00,586.20,587.30,-0.46,"51,037.00","30,052,229.30"

In [31]:
nabil_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2845 entries, 0 to 2844
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      2845 non-null   object
 1   Open      2845 non-null   object
 2   High      2845 non-null   object
 3   Low       2845 non-null   object
 4   Ltp       2845 non-null   object
 5   % Change  2845 non-null   object
 6   Qty       2845 non-null   object
 7   Turnover  2845 non-null   object
dtypes: object(8)
memory usage: 177.9+ KB

In [32]:
nabil_df.isnull().sum()

Date        0
Open        0
High        0
Low         0
Ltp         0
% Change    0
Qty         0
Turnover    0
dtype: int64

In [33]:
nabil_df['Date'] = pd.to_datetime(nabil_df['Date'])

In [34]:
# columns with comma in numerical values
cols_comma_values = ['Open', 'High', 'Low', 'Ltp', 'Qty', 'Turnover']

for col in cols_comma_values:
    # Remove commas and convert the column to float data type
    nabil_df[col] = nabil_df[col].apply(lambda x: x.replace(",", ""))
    nabil_df[col] = nabil_df[col].astype('float64')

In [35]:
nabil_df['% Change'] = nabil_df['% Change'].astype('float64')

In [36]:
nabil_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2845 entries, 0 to 2844
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      2845 non-null   datetime64[ns]
 1   Open      2845 non-null   float64
 2   High      2845 non-null   float64
 3   Low       2845 non-null   float64
 4   Ltp       2845 non-null   float64
 5   % Change  2845 non-null   float64
 6   Qty       2845 non-null   float64
 7   Turnover  2845 non-null   float64
dtypes: datetime64[ns](1), float64(7)
memory usage: 177.9 KB

In [64]:
# Export DataFrame to csv file
nabil_df.to_csv("Stock Price History/NABIL Stock Price History.csv", index = False)

## 3. Prabhu Life Insurance Limited ( PLI )

In [6]:
# Define the url to scrape price history data from
url = "https://www.sharesansar.com/company/pli"

# Call the scrape_price_history function to fetch the data
prabhu_life_price_history = scrape_price_history(url)

In [7]:
# Create a DataFrame to store the scraped price history data
prabhu_life_df = pd.DataFrame({
    "Date" : prabhu_life_price_history[0],
    "Open" : prabhu_life_price_history[1],
    "High" : prabhu_life_price_history[2],
    "Low" : prabhu_life_price_history[3],
    "Ltp" : prabhu_life_price_history[4],
    "% Change" : prabhu_life_price_history[5],
    "Qty" : prabhu_life_price_history[6],
    "Turnover" : prabhu_life_price_history[7]
})

In [37]:
prabhu_life_df.shape

(499, 8)

In [38]:
prabhu_life_df.head()

,Date,Open,High,Low,Ltp,% Change,Qty,Turnover
0,2023-07-13,609.90,611.80,586.20,587.00,-2.17,"28,431.00","16,938,180.70"
1,2023-07-12,590.10,610.00,590.10,600.00,0.00,"18,558.00","11,186,860.90"
2,2023-07-11,600.00,607.00,594.90,600.00,-1.15,"17,562.00","10,544,867.00"
3,2023-07-10,615.00,626.00,602.80,607.00,-1.14,"17,257.00","10,591,216.40"
4,2023-07-09,590.00,619.90,590.00,614.00,2.85,"16,717.00","10,203,472.80"

In [39]:
prabhu_life_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 499 entries, 0 to 498
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      499 non-null    object
 1   Open      499 non-null    object
 2   High      499 non-null    object
 3   Low       499 non-null    object
 4   Ltp       499 non-null    object
 5   % Change  499 non-null    object
 6   Qty       499 non-null    object
 7   Turnover  499 non-null    object
dtypes: object(8)
memory usage: 31.3+ KB

In [40]:
prabhu_life_df['Date'] = pd.to_datetime(prabhu_life_df['Date'])

In [41]:
# columns with comma in numerical values
cols_comma_values = ['Open', 'High', 'Low', 'Ltp', 'Qty', 'Turnover']

for col in cols_comma_values:
    # Remove commas and convert the column to float data type
    prabhu_life_df[col] = prabhu_life_df[col].apply(lambda x: x.replace(",", ""))
    prabhu_life_df[col] = prabhu_life_df[col].astype('float64')

In [42]:
prabhu_life_df['% Change'] = prabhu_life_df['% Change'].astype('float64')

In [43]:
prabhu_life_df.head()

        Date   Open   High    Low    Ltp  % Change      Qty    Turnover
0 2023-07-13  609.9  611.8  586.2  587.0     -2.17  28431.0  16938180.7
1 2023-07-12  590.1  610.0  590.1  600.0      0.00  18558.0  11186860.9
2 2023-07-11  600.0  607.0  594.9  600.0     -1.15  17562.0  10544867.0
3 2023-07-10  615.0  626.0  602.8  607.0     -1.14  17257.0  10591216.4
4 2023-07-09  590.0  619.9  590.0  614.0      2.85  16717.0  10203472.8

In [44]:
prabhu_life_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 499 entries, 0 to 498
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      499 non-null    datetime64[ns]
 1   Open      499 non-null    float64
 2   High      499 non-null    float64
 3   Low       499 non-null    float64
 4   Ltp       499 non-null    float64
 5   % Change  499 non-null    float64
 6   Qty       499 non-null    float64
 7   Turnover  499 non-null    float64
dtypes: datetime64[ns](1), float64(7)
memory usage: 31.3 KB

In [65]:
# Export DataFrame to csv file
prabhu_life_df.to_csv("Stock Price History/PLI Stock Price History.csv", index = False)

## 4. Shivam Cements Limited ( SHIVM )

In [8]:
# Define the url to scrape price history data from
url = "https://www.sharesansar.com/company/shivm"

# Call the scrape_price_history function to fetch the data
shivam_price_history = scrape_price_history(url)

In [9]:
# Create a DataFrame to store the scraped price history data
shivam_df = pd.DataFrame({
    "Date" : shivam_price_history[0],
    "Open" : shivam_price_history[1],
    "High" : shivam_price_history[2],
    "Low" : shivam_price_history[3],
    "Ltp" : shivam_price_history[4],
    "% Change" : shivam_price_history[5],
    "Qty" : shivam_price_history[6],
    "Turnover" : shivam_price_history[7]
})

In [45]:
shivam_df.shape

(1019, 8)

In [46]:
shivam_df.head()

,Date,Open,High,Low,Ltp,% Change,Qty,Turnover
0,2023-09-07,493.70,503.00,483.40,485.00,-2.41,"77,324.00","37,781,720.10"
1,2023-09-05,507.00,507.00,496.00,497.00,-1.19,"36,282.00","18,133,269.50"
2,2023-09-04,503.00,509.90,490.00,503.00,1.00,"84,031.00","41,959,034.20"
3,2023-09-03,508.00,512.90,497.00,498.00,-1.97,"57,536.00","28,923,034.10"
4,2023-08-30,510.00,518.00,506.50,508.00,-0.39,"51,987.00","26,492,571.90"

In [47]:
shivam_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1019 entries, 0 to 1018
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      1019 non-null   object
 1   Open      1019 non-null   object
 2   High      1019 non-null   object
 3   Low       1019 non-null   object
 4   Ltp       1019 non-null   object
 5   % Change  1019 non-null   object
 6   Qty       1019 non-null   object
 7   Turnover  1019 non-null   object
dtypes: object(8)
memory usage: 63.8+ KB

In [48]:
shivam_df.isnull().sum()

Date        0
Open        0
High        0
Low         0
Ltp         0
% Change    0
Qty         0
Turnover    0
dtype: int64

In [49]:
shivam_df['Date'] = pd.to_datetime(shivam_df['Date'])

In [50]:
# columns with comma in numerical values
cols_comma_values = ['Open', 'High', 'Low', 'Ltp', 'Qty', 'Turnover']

for col in cols_comma_values:
    # Remove commas and convert the column to float data type
    shivam_df[col] = shivam_df[col].apply(lambda x: x.replace(",", ""))
    shivam_df[col] = shivam_df[col].astype('float64')

In [51]:
shivam_df['% Change'] = shivam_df['% Change'].astype('float64')

In [52]:
shivam_df.head()

        Date   Open   High    Low    Ltp  % Change      Qty    Turnover
0 2023-09-07  493.7  503.0  483.4  485.0     -2.41  77324.0  37781720.1
1 2023-09-05  507.0  507.0  496.0  497.0     -1.19  36282.0  18133269.5
2 2023-09-04  503.0  509.9  490.0  503.0      1.00  84031.0  41959034.2
3 2023-09-03  508.0  512.9  497.0  498.0     -1.97  57536.0  28923034.1
4 2023-08-30  510.0  518.0  506.5  508.0     -0.39  51987.0  26492571.9

In [53]:
shivam_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1019 entries, 0 to 1018
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      1019 non-null   datetime64[ns]
 1   Open      1019 non-null   float64
 2   High      1019 non-null   float64
 3   Low       1019 non-null   float64
 4   Ltp       1019 non-null   float64
 5   % Change  1019 non-null   float64
 6   Qty       1019 non-null   float64
 7   Turnover  1019 non-null   float64
dtypes: datetime64[ns](1), float64(7)
memory usage: 63.8 KB

In [66]:
# Export DataFrame to csv file
shivam_df.to_csv("Stock Price History/SHIVM Stock Price History.csv", index = False)

## 5. National Hydro Power Company Limited ( NHPC )

In [10]:
# Define the url to scrape price history data from
url = "https://www.sharesansar.com/company/nhpc"

# Call the scrape_price_history function to fetch the data
national_price_history = scrape_price_history(url)

In [11]:
# Create a DataFrame to store the scraped price history data
national_df = pd.DataFrame({
    "Date" : national_price_history[0],
    "Open" : national_price_history[1],
    "High" : national_price_history[2],
    "Low" : national_price_history[3],
    "Ltp" : national_price_history[4],
    "% Change" : national_price_history[5],
    "Qty" : national_price_history[6],
    "Turnover" : national_price_history[7]
})

In [54]:
national_df.shape

(2557, 8)

In [55]:
national_df.head()

,Date,Open,High,Low,Ltp,% Change,Qty,Turnover
0,2023-09-07,138.20,140.00,137.00,137.10,-2.07,"24,688.00","3,409,217.30"
1,2023-09-05,144.00,144.00,140.00,140.00,-2.78,"34,843.00","4,919,761.30"
2,2023-09-04,145.50,146.50,142.70,144.00,-1.03,"21,315.00","3,065,983.60"
3,2023-09-03,148.00,148.00,144.00,145.50,-0.68,"17,124.00","2,481,711.00"
4,2023-08-30,148.00,149.00,145.80,146.50,0.07,"12,184.00","1,793,512.90"

In [56]:
national_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2557 entries, 0 to 2556
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      2557 non-null   object
 1   Open      2557 non-null   object
 2   High      2557 non-null   object
 3   Low       2557 non-null   object
 4   Ltp       2557 non-null   object
 5   % Change  2557 non-null   object
 6   Qty       2557 non-null   object
 7   Turnover  2557 non-null   object
dtypes: object(8)
memory usage: 159.9+ KB

In [57]:
national_df['Date'] = pd.to_datetime(national_df['Date'])

In [58]:
# columns with comma in numerical values
cols_comma_values = ['Open', 'High', 'Low', 'Ltp', 'Qty', 'Turnover']

for col in cols_comma_values:
    # Remove commas and convert the column to float data type
    national_df[col] = national_df[col].apply(lambda x: x.replace(",", ""))
    national_df[col] = national_df[col].astype('float64')

In [59]:
national_df['% Change'] = national_df['% Change'].astype('float64')

In [60]:
national_df.head()

        Date   Open   High    Low    Ltp  % Change      Qty   Turnover
0 2023-09-07  138.2  140.0  137.0  137.1     -2.07  24688.0  3409217.3
1 2023-09-05  144.0  144.0  140.0  140.0     -2.78  34843.0  4919761.3
2 2023-09-04  145.5  146.5  142.7  144.0     -1.03  21315.0  3065983.6
3 2023-09-03  148.0  148.0  144.0  145.5     -0.68  17124.0  2481711.0
4 2023-08-30  148.0  149.0  145.8  146.5      0.07  12184.0  1793512.9

In [61]:
national_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2557 entries, 0 to 2556
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      2557 non-null   datetime64[ns]
 1   Open      2557 non-null   float64
 2   High      2557 non-null   float64
 3   Low       2557 non-null   float64
 4   Ltp       2557 non-null   float64
 5   % Change  2557 non-null   float64
 6   Qty       2557 non-null   float64
 7   Turnover  2557 non-null   float64
dtypes: datetime64[ns](1), float64(7)
memory usage: 159.9 KB

In [67]:
# Export DataFrame to csv file
national_df.to_csv("Stock Price History/NHPC Stock Price History.csv", index = False)